### ✅  Successfully applied Terraform CDK Stack 'gab-cdk-dev'


<details><summary>Show Run</summary>

```shell
gab-cdk-dev  Initializing the backend...
gab-cdk-dev  Successfully configured the backend "azurerm"! Terraform will automatically
             use this backend unless the backend configuration changes.
gab-cdk-dev  Initializing modules...
gab-cdk-dev  Downloading registry.terraform.io/Azure/naming/azurerm 0.2.0 for naming...
gab-cdk-dev  - naming in .terraform/modules/naming
gab-cdk-dev  Initializing provider plugins...
             - Finding hashicorp/azurerm versions matching "3.52.0"...
gab-cdk-dev  - Finding hashicorp/random versions matching ">= 3.3.2"...
gab-cdk-dev  - Installing hashicorp/azurerm v3.52.0...
gab-cdk-dev  - Installed hashicorp/azurerm v3.52.0 (signed by HashiCorp)
gab-cdk-dev  - Installing hashicorp/random v3.5.1...
gab-cdk-dev  - Installed hashicorp/random v3.5.1 (signed by HashiCorp)
gab-cdk-dev  Terraform has created a lock file .terraform.lock.hcl to record the provider
             selections it made above. Include this file in your version control repository
             so that Terraform can guarantee to make the same selections by default when
             you run "terraform init" in the future.

             Terraform has been successfully initialized!

             You may now begin working with Terraform. Try running "terraform plan" to see
             any changes that are required for your infrastructure. All Terraform commands
             should now work.

             If you ever set or change modules or backend configuration for Terraform,
             rerun this command to reinitialize your working directory. If you forget, other
             commands will detect it and remind you to do so if necessary.
gab-cdk-dev  - Fetching hashicorp/azurerm 3.52.0 for linux_amd64...
gab-cdk-dev  - Retrieved hashicorp/azurerm 3.52.0 for linux_amd64 (signed by HashiCorp)
gab-cdk-dev  - Fetching hashicorp/random 3.5.1 for linux_amd64...
gab-cdk-dev  - Retrieved hashicorp/random 3.5.1 for linux_amd64 (signed by HashiCorp)
             - Obtained hashicorp/azurerm checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
             - Obtained hashicorp/random checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
gab-cdk-dev  Success! Terraform has validated the lock file and found no need for changes.
gab-cdk-dev  Acquiring state lock. This may take a few moments...
gab-cdk-dev
gab-cdk-dev
gab-cdk-dev  Terraform used the selected providers to generate the following execution plan.
             Resource actions are indicated with the following symbols:
               + create

             Terraform will perform the following actions:

               # azurerm_linux_function_app.gab_linux_function_app (gab_linux_function_app) will be created
               + resource "azurerm_linux_function_app" "gab_linux_function_app" {
                   + builtin_logging_enabled           = true
                   + client_certificate_enabled        = false
                   + client_certificate_mode           = "Optional"
                   + content_share_force_disabled      = false
                   + custom_domain_verification_id     = (sensitive value)
                   + daily_memory_time_quota           = 0
                   + default_hostname                  = (known after apply)
                   + enabled                           = true
                   + functions_extension_version       = "~4"
                   + https_only                        = false
                   + id                                = (known after apply)
                   + key_vault_reference_identity_id   = (known after apply)
                   + kind                              = (known after apply)
                   + location                          = "westeurope"
                   + name                              = "gab-plan-dev"
                   + outbound_ip_address_list          = (known after apply)
                   + outbound_ip_addresses             = (known after apply)
                   + possible_outbound_ip_address_list = (known after apply)
                   + possible_outbound_ip_addresses    = (known after apply)
                   + resource_group_name               = "gab-rg-dev"
                   + service_plan_id                   = (known after apply)
                   + site_credential                   = (sensitive value)
                   + storage_account_access_key        = (sensitive value)
                   + storage_account_name              = "gabstdev"
                   + storage_uses_managed_identity     = false
                   + tags                              = {
                       + "environment" = "dev"
                       + "owner"       = "GAB"
                       + "project"     = "GAB-Rennes"
                     }
                   + zip_deploy_file                   = (known after apply)

                   + site_config {
                       + always_on                               = (known after apply)
                       + app_scale_limit                         = (known after apply)
                       + container_registry_use_managed_identity = false
                       + default_documents                       = (known after apply)
                       + detailed_error_logging_enabled          = (known after apply)
                       + elastic_instance_minimum                = (known after apply)
                       + ftps_state                              = "Disabled"
                       + health_check_eviction_time_in_min       = (known after apply)
                       + http2_enabled                           = false
                       + linux_fx_version                        = (known after apply)
                       + load_balancing_mode                     = "LeastRequests"
                       + managed_pipeline_mode                   = "Integrated"
                       + minimum_tls_version                     = "1.2"
                       + pre_warmed_instance_count               = (known after apply)
                       + remote_debugging_enabled                = false
                       + remote_debugging_version                = (known after apply)
                       + scm_minimum_tls_version                 = "1.2"
                       + scm_type                                = (known after apply)
                       + scm_use_main_ip_restriction             = false
                       + use_32_bit_worker                       = false
                       + vnet_route_all_enabled                  = false
                       + websockets_enabled                      = false
                       + worker_count                            = (known after apply)
                     }
                 }

               # azurerm_resource_group.gab_rg (gab_rg) will be created
               + resource "azurerm_resource_group" "gab_rg" {
                   + id       = (known after apply)
                   + location = "westeurope"
                   + name     = "gab-rg-dev"
                   + tags     = {
                       + "environment" = "dev"
                       + "owner"       = "GAB"
                       + "project"     = "GAB-Rennes"
                     }
                 }

               # azurerm_service_plan.gab_service_plan (gab_service_plan) will be created
               + reso
gab-cdk-dev  urce "azurerm_service_plan" "gab_service_plan" {
                   + id                           = (known after apply)
                   + kind                         = (known after apply)
                   + location                     = "westeurope"
                   + maximum_elastic_worker_count = (known after apply)
                   + name                         = "gab-plan-dev"
                   + os_type                      = "Linux"
                   + per_site_scaling_enabled     = false
                   + reserved                     = (known after apply)
                   + resource_group_name          = "gab-rg-dev"
                   + sku_name                     = "B1"
                   + tags                         = {
                       + "environment" = "dev"
                       + "owner"       = "GAB"
                       + "project"     = "GAB-Rennes"
                     }
                   + worker_count                 = (known after apply)
                 }

               # azurerm_storage_account.gab_storage_account (gab_storage_account) will be created
               + resource "azurerm_storage_account" "gab_storage_account" {
                   + access_tier                       = (known after apply)
                   + account_kind                      = "StorageV2"
                   + account_replication_type          = "LRS"
                   + account_tier                      = "Standard"
                   + allow_nested_items_to_be_public   = true
                   + cross_tenant_replication_enabled  = true
                   + default_to_oauth_authentication   = false
                   + enable_https_traffic_only         = true
                   + id                                = (known after apply)
                   + infrastructure_encryption_enabled = false
                   + is_hns_enabled                    = false
                   + large_file_share_enabled          = (known after apply)
                   + location                          = "westeurope"
                   + min_tls_version                   = "TLS1_2"
                   + name                              = "gabstdev"
                   + nfsv3_enabled                     = false
                   + primary_access_key                = (sensitive value)
                   + primary_blob_connection_string    = (sensitive value)
                   + primary_blob_endpoint             = (known after apply)
                   + primary_blob_host                 = (known after apply)
                   + primary_connection_string         = (sensitive value)
                   + primary_dfs_endpoint              = (known after apply)
                   + primary_dfs_host                  = (known after apply)
                   + primary_file_endpoint             = (known after apply)
                   + primary_file_host                 = (known after apply)
                   + primary_location                  = (known after apply)
                   + primary_queue_endpoint            = (known after apply)
                   + primary_queue_host                = (known after apply)
                   + primary_table_endpoint            = (known after apply)
                   + primary_table_host                = (known after apply)
                   + primary_web_endpoint              = (known after apply)
                   + primary_web_host                  = (known after apply)
                   + public_network_access_enabled     = true
                   + queue_encryption_key_type         = "Service"
                   + resource_group_name               = "gab-rg-dev"
                   + secondary_access_key              = (sensitive value)
                   + secondary_blob_connection_string  = (sensitive value)
                   + secondary_blob_endpoint           = (known after apply)
                   + secondary_blob_host               = (known after apply)
                   + secondary_connection_string       = (sensitive value)
                   + secondary_dfs_endpoint            = (known after apply)
                   + secondary_dfs_host                = (known after apply)
                   + secondary_file_endpoint           = (known after apply)
                   + secondary_file_host               = (known after apply)
                   + secondary_location                = (known after apply)
                   + secondary_queue_endpoint          = (known after apply)
                   + secondary_queue_host              = (known after apply)
                   + secondary_table_endpoint          = (known after apply)
                   + secondary_table_host              = (known after apply)
                   + secondary_web_endpoint            = (known after apply)
                   + secondary_web_host                = (known after apply)
                   + sftp_enabled
gab-cdk-dev  = false
                   + shared_access_key_enabled         = true
                   + table_encryption_key_type         = "Service"
                   + tags                              = {
                       + "environment" = "dev"
                       + "owner"       = "GAB"
                       + "project"     = "GAB-Rennes"
                     }
                 }

               # module.naming.random_string.first_letter will be created
               + resource "random_string" "first_letter" {
                   + id          = (known after apply)
                   + length      = 1
                   + lower       = true
                   + min_lower   = 0
                   + min_numeric = 0
                   + min_special = 0
                   + min_upper   = 0
                   + number      = false
                   + numeric     = false
                   + result      = (known after apply)
                   + special     = false
                   + upper       = false
                 }

               # module.naming.random_string.main will be created
               + resource "random_string" "main" {
                   + id          = (known after apply)
                   + length      = 60
                   + lower       = true
                   + min_lower   = 0
                   + min_numeric = 0
                   + min_special = 0
                   + min_upper   = 0
                   + number      = true
                   + numeric     = true
                   + result      = (known after apply)
                   + special     = false
                   + upper       = false
                 }

             Plan: 6 to add, 0 to change, 0 to destroy.
gab-cdk-dev  module.naming.random_string.main: Creating...
gab-cdk-dev  module.naming.random_string.main: Creation complete after 0s [id=rnbwwstn7xa4hmq0auh5nt87gy6jj0wqh4a3am2qkuod11urhh179kgrfg4y]
gab-cdk-dev  module.naming.random_string.first_letter: Creating...
             module.naming.random_string.first_letter: Creation complete after 0s [id=r]
gab-cdk-dev  azurerm_resource_group.gab_rg (gab_rg): Creating...
gab-cdk-dev  azurerm_resource_group.gab_rg (gab_rg): Creation complete after 2s [id=/subscriptions/71c21549-810b-4565-ae36-9434edb23fc2/resourceGroups/gab-rg-dev]
gab-cdk-dev  azurerm_service_plan.gab_service_plan (gab_service_plan): Creating...
gab-cdk-dev  azurerm_storage_account.gab_storage_account (gab_storage_account): Creating...
gab-cdk-dev  azurerm_service_plan.gab_service_plan (gab_service_plan): Creation complete after 10s [id=/subscriptions/71c21549-810b-4565-ae36-9434edb23fc2/resourceGroups/gab-rg-dev/providers/Microsoft.Web/serverfarms/gab-plan-dev]
gab-cdk-dev  azurerm_storage_account.gab_storage_account (gab_storage_account): Still creating... [10s elapsed]
gab-cdk-dev  azurerm_storage_account.gab_storage_account (gab_storage_account): Still creating... [20s elapsed]
gab-cdk-dev  azurerm_storage_account.gab_storage_account (gab_storage_account): Creation complete after 26s [id=/subscriptions/71c21549-810b-4565-ae36-9434edb23fc2/resourceGroups/gab-rg-dev/providers/Microsoft.Storage/storageAccounts/gabstdev]
gab-cdk-dev  azurerm_linux_function_app.gab_linux_function_app (gab_linux_function_app): Creating...
gab-cdk-dev  azurerm_linux_function_app.gab_linux_function_app (gab_linux_function_app): Still creating... [10s elapsed]
gab-cdk-dev  azurerm_linux_function_app.gab_linux_function_app (gab_linux_function_app): Still creating... [20s elapsed]
gab-cdk-dev  azurerm_linux_function_app.gab_linux_function_app (gab_linux_function_app): Still creating... [30s elapsed]
gab-cdk-dev  azurerm_linux_function_app.gab_linux_function_app (gab_linux_function_app): Still creating... [40s elapsed]
gab-cdk-dev  azurerm_linux_function_app.gab_linux_function_app (gab_linux_function_app): Still creating... [50s elapsed]
gab-cdk-dev  azurerm_linux_function_app.gab_linux_function_app (gab_linux_function_app): Still creating... [1m0s elapsed]
gab-cdk-dev  azurerm_linux_function_app.gab_linux_function_app (gab_linux_function_app): Still creating... [1m10s elapsed]
gab-cdk-dev  azurerm_linux_function_app.gab_linux_function_app (gab_linux_function_app): Still creating... [1m20s elapsed]
gab-cdk-dev  azurerm_linux_function_app.gab_linux_function_app (gab_linux_function_app): Still creating... [1m30s elapsed]
gab-cdk-dev  azurerm_linux_function_app.gab_linux_function_app (gab_linux_function_app): Still creating... [1m40s elapsed]
gab-cdk-dev  azurerm_linux_function_app.gab_linux_function_app (gab_linux_function_app): Still creating... [1m50s elapsed]
gab-cdk-dev  azurerm_linux_function_app.gab_linux_function_app (gab_linux_function_app): Still creating... [2m0s elapsed]
gab-cdk-dev  azurerm_linux_function_app.gab_linux_function_app (gab_linux_function_app): Still creating... [2m10s elapsed]
gab-cdk-dev  azurerm_linux_function_app.gab_linux_function_app (gab_linux_function_app): Creation complete after 2m20s [id=/subscriptions/71c21549-810b-4565-ae36-9434edb23fc2/resourceGroups/gab-rg-dev/providers/Microsoft.Web/sites/gab-plan-dev]
gab-cdk-dev  Releasing state lock. This may take a few moments...
gab-cdk-dev  Apply complete! Resources: 6 added, 0 changed, 0 destroyed.

No outputs found.

```

</details>